In [1]:
import pandas as pd

# Pandas Series

In [16]:
data = ['Josh', 'John', 'Mary', 'Anna', 'Peter']
pos = ['a', 'b', 'c', 'd', 'e']

series = pd.Series(data, index=pos)

In [18]:
series

a     Josh
b     John
c     Mary
d     Anna
e    Peter
dtype: object

In [20]:
series['f'] = 'Yamal'

In [22]:
series

a     Josh
b     John
c     Mary
d     Anna
e    Peter
f    Yamal
dtype: object

In [24]:
type(series)

pandas.core.series.Series

In [36]:
series.drop('a')

b     John
c     Mary
d     Anna
e    Peter
f    Yamal
dtype: object

# Pandas Data frame

In [43]:
x = {'Names' : ['Josh', 'John', 'Mary', 'Anna', 'Peter'],
    'Score': [34, 38, 12, 90, 56],
    'Age': [23, 34, 45, 23, 34]}

info = pd.DataFrame(x)

In [45]:
info

   Names  Score  Age
0   Josh     34   23
1   John     38   34
2   Mary     12   45
3   Anna     90   23
4  Peter     56   34